export const questions = [
    {
        question: "Петроградский Совет рабочих и солдатских депутатов был образован в:",
        answers: [
            { text: "феврале 1917 г.", correct: true },
            { text: "марте 1917 г.", correct: false },
            { text: "январе 1917 г.", correct: false }
        ]
    },
    {
        question: "Император Николай II отрекся от престола:",
        answers: [
            { text: "18 апреля 1917 г.", correct: false },
            { text: "2 марта 1917 г.", correct: true },
            { text: "27 февраля 1917 г.", correct: false }
        ]
    },
    {
        question: "Временное правительство было создано под председательством:",
        answers: [
            { text: "Милюкова", correct: false },
            { text: "Гучкова", correct: false },
            { text: "Льва Львова", correct: true }
        ]
    },
    {
        question: "Приказ № 1 по армии, изданный Временным правительством, предписывал:",
        answers: [
            { text: "обязательное одобрение солдатскими комитетами всех приказов офицеров", correct: true },
            { text: "периодическую замену воинских частей на фронте войсками тыловых гарнизонов", correct: false },
            { text: "запрещение политической агитации в воинских частях", correct: false }
        ]
    },
    {
        question: "Коалиционное правительство в составе 10 министров капиталистов и 6 министров-социалистов было создано в 1917 г.:",
        answers: [
            { text: "18 апреля", correct: false },
            { text: "6 августа", correct: false },
            { text: "5 мая", correct: true }
        ]
    },
    {
        question: "Съезд Советов, на котором Ленин впервые заявил о том, что партия большевиков готова взять власть в свои руки, состоялся:",
        answers: [
            { text: "14-22 сентября 1917 г.", correct: false },
            { text: "3-24 июня 1917 г.", correct: true },
            { text: "10-14 октября 1917 г.", correct: false }
        ]
    },
    {
        question: "Кто из названных лиц призывал “Не поддерживать Временное правительство!”:",
        answers: [
            { text: "Плеханов", correct: false },
            { text: "Милюков", correct: false },
            { text: "Ленин", correct: true }
        ]
    },
    {
        question: "Июньский кризис Временного правительства разразился вследствие:",
        answers: [
            { text: "провала наступления на фронте", correct: true },
            { text: "отставки кадетов в правительстве", correct: false },
            { text: "нежелания правительства назначить выборы в Учредительное собрание", correct: false }
        ]
    },
    {
        question: "Выступление генерала Корнилова началось в:",
        answers: [
            { text: "октябре 1917 г.", correct: false },
            { text: "сентябре 1917 г.", correct: false },
            { text: "августе 1917 г.", correct: true }
        ]
    },
    {
        question: "Выберете неверное положение. Временное правительство объявило:",
        answers: [
            { text: "о подготовке созыва Учредительного собрания", correct: false },
            { text: "о введении 8-часового рабочего дня", correct: true },
            { text: "о создании волостных земств", correct: false }
        ]
    },
    {
        question: "На введении культурно-национальной автономии и развитии системы местного самоуправления на национальных окраинах Российской империи настаивали:",
        answers: [

            { text: "революционеры (социал-демократы)", correct: true },
            { text: "трудовики", correct: false },
            { text: "земские либералы", correct: false }
        ]
    },
    {
        question: "Император Николай II отрекся от престола в пользу:",
        answers: [
            { text: "Государственной думы", correct: false },
            { text: "брата Михаила", correct: true },
            { text: "Временного правительства", correct: false }
        ]
    },
    {
        question: "Ленин вернулся из-за границы и выступил с докладом “О задачах пролетариата в данной революции” в:",
        answers: [
            { text: "4 апреля 1917 г.", correct: true },
            { text: "5 июля 1917 г.", correct: false },
            { text: "2 марта 1917 г.", correct: false }
        ]
    },
    {
        question: "Председателем Петроградского совета рабочих и солдатских депутатов был избран:",
        answers: [
            { text: "Керенский", correct: false },
            { text: "Мартов", correct: false },
            { text: "Чхеидзе", correct: true }
        ]
    },
    {
        question: "Заключить мир без аннексий и контрибуций предлагали:",
        answers: [
            { text: "большевики", correct: true },
            { text: "октябристы", correct: false },
            { text: "кадеты", correct: false }
        ]
    },
    {
        question: "Большевиков обвинили в подготовке антиправительственного восстания:",
        answers: [
            { text: "в августе 1917 г.", correct: false },
            { text: "в июле 1917 г.", correct: true },
            { text: "в апреле 1917 г.", correct: false }
        ]
    },
    {
        question: "С какой проблемой столкнулись жители городов накануне Февральской революции 1917 года:",
        answers: [
            { text: "произвол чиновников", correct: false },
            { text: "превышение полномочий сотрудниками полиции", correct: false },
            { text: "перебои с поставкой хлеба и карточная система", correct: true }
        ]
    },
    {
        question: "Участие России в какой войне привело к экономическому кризису в стране и стало одной из причин Февральской революции 1917:",
        answers: [
            { text: "Гражданская война в России 1917-1922", correct: false },
            { text: "Первая мировая война 1914-1918", correct: true },
            { text: "Англо-бурская война 1899-1902", correct: false }
        ]
    },
    {
        question: "Во время правления какого российского императора произошла Февральская революция 1917:",
        answers: [
            { text: "Николай I", correct: false },
            { text: "Александр III", correct: false },
            { text: "Николай II", correct: true }
        ]
    },
    {
        question: "Какая революция привела к свержению самодержавия в России:",
        answers: [
            { text: "Октябрьская революция 1917", correct: false },
            { text: "Февральская революция 1917", correct: true },
            { text: "Русская революция 1905-1907", correct: false }
        ]
    },
    {
        question: "Руководство какого крупного предприятия уволило бастующих рабочих и тем самым спровоцировало волну массовых забастовок 23 февраля 1917 года:",
        answers: [
            { text: "Путиловский завод", correct: true },
            { text: "Обуховский завод", correct: false },
            { text: "завод “Арсенал”", correct: false }
        ]
    },
    {
        question: "Какой объект не был захвачен участниками вооруженного восстания 27 февраля 1917 года:",
        answers: [
            { text: "Кронверкский арсенал", correct: false },

            { text: "Зимний дворец", correct: true },
            { text: "Главпочтамт", correct: false }
        ]
    },
    {
        question: "Когда был опубликован манифест об отречении Николая II:",
        answers: [
            { text: "3 марта 1917 года", correct: false },
            { text: "27 февраля 1917 года", correct: false },
            { text: "4 марта 1917 года", correct: true }
        ]
    }
];
