export const personalities = [
    {
        id: 1,
        name: "Ленин (Ульянов Владимир Ильич)",
        description: "Российский революционер и политик, основатель советского государства.",
        birthDate: "22 апреля 1870",
        deathDate: "21 января 1924",
        image: "https://avatars.mds.yandex.net/i?id=3a7cdec45d69b6d8d1a9bd50c31b33b854e3346c-4216017-images-thumbs&n=13",
        achievements: [
            "Основание РСФСР",
            "Руководство Октябрьской революцией",
            "Создание Коммунистического Интернационала"
        ]
    },
    {
        id: 2,
        name: "Троцкий (Лев Давидович)",
        description: "Российский революционер, теоретик и политический деятель, один из лидеров Октябрьской революции.",
        birthDate: "7 ноября 1879",
        deathDate: "21 августа 1940",
        image: "https://avatars.mds.yandex.net/i?id=59db1a85f3ede0a8474db34b35d9ec8762f53b7f-8082760-images-thumbs&n=13",
        achievements: [
            "Организация Красной Армии",
            "Лидер мирового троцкизма",
            "Создание теории постоянной революции"
        ]
    },
    {
        id: 3,
        name: "Николай II (Романов Николай Александрович)",
        description: "Последний император Российской империи, отрекшийся от престола в ходе Февральской революции.",
        birthDate: "18 мая 1868",
        deathDate: "17 июля 1918",
        image: "https://avatars.mds.yandex.net/i?id=f56381e312dbd980be259ba538ea20ca-5888638-images-thumbs&n=13",
        achievements: [
            "Правление Российской империей",
            "Участие в Первой мировой войне",
            "Отречение от престола"
        ]
    },
    {
        id: 4,
        name: "Александр Керенский",
        description: "Российский политик, министр-председатель Временного правительства в 1917 году.",
        birthDate: "4 мая 1881",
        deathDate: "11 июня 1970",
        image: "https://static1-repo.aif.ru/1/3d/138945/6d11e4608b582126cef7f444bf346622.jpg",
        achievements: [
            "Глава Временного правительства",
            "Попытка подавления Корниловского мятежа",
            "Бегство из России после Октябрьской революции"
        ]
    },
    {
        id: 5,
        name: "Лавр Корнилов",
        description: "Русский генерал, участник Первой мировой войны, организатор Корниловского мятежа.",
        birthDate: "30 августа 1870",
        deathDate: "13 апреля 1918",
        image: "https://sun9-70.userapi.com/impg/pwZbR_xMw4P0S03f8cxxgM2IM2WpIhcZd997tg/3Rxwn5TA7uQ.jpg?size=640x640&quality=96&sign=c150da5228743da9ca527d766dbd3a31&c_uniq_tag=M8rKaJfDJ9ZSq20FN_NMq7eQelVuo73vzD8qzgpG12o&type=album",
        achievements: [
            "Организация Корниловского мятежа",
            "Командование Добровольческой армией",
            "Участие в Гражданской войне"
        ]
    },
    {
        id: 6,
        name: "Феликс Дзержинский",
        description: "Революционер, основатель и глава ВЧК (Всероссийской чрезвычайной комиссии).",
        birthDate: "11 сентября 1877",
        deathDate: "20 июля 1926",
        image: "https://media.dynamo.su/iblock/9a2/pqzbuu6k9eu9f22pstbm1elx8s05114s.JPG",
        achievements: [
            "Создание ВЧК",
            "Борьба с контрреволюцией",
            "Организация «красного террора»"
        ]
    },
    {
        id: 7,
        name: "Григорий Распутин",
        description: "Друг семьи Николая II, известный своим влиянием на императорскую семью.",
        birthDate: "21 января 1869",
        deathDate: "30 декабря 1916",
        image: "https://media.izi.travel/2ebd0b11-807e-46a5-bbe9-761e69531a50/c179e0c3-4768-4eb7-a2f2-3dfe69f6896a_800x600.jpg",
        achievements: [
            "Влияние на политику Николая II",
            "Скандальная репутация в обществе",
            "Убийство в 1916 году"
        ]
    },
    {
        id: 8,
        name: "Александра Коллонтай",
        description: "Российская революционерка, дипломат и сторонница женского равноправия.",
        birthDate: "31 марта 1872",
        deathDate: "9 марта 1952",
        image: "https://cdnn21.img.ria.ru/images/149667/61/1496676102_0:0:1428:2048_600x0_80_0_1_495e5bf329d913cb63ef01d2b58b15de.jpg",
        achievements: [
            "Борьба за права женщин",
            "Первая женщина-министр в правительстве",
            "Дипломатическая деятельность"
        ]
    },
    {
        id: 9,
        name: "Михаил Родзянко",
        description: "Российский политик, председатель Государственной думы в 1917 году.",
        birthDate: "21 марта 1859",
        deathDate: "24 января 1924",
        image: "https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_66a89d973c781b7170b40808_66aaa59c96a7bb51e28552d1/scale_1200",
        achievements: [
            "Участие в Февральской революции",
            "Поддержка отречения Николая II",
            "Эмиграция после Октябрьской революции"
        ]
    },
    {
        id: 10,
        name: "Антон Деникин",
        description: "Русский генерал, один из лидеров Белого движения в Гражданской войне.",
        birthDate: "16 декабря 1872",
        deathDate: "8 августа 1947",
        image: "https://media.pravoslavie.ru/427324.p.jpg?mtime=1702477530",
        achievements: [
            "Командование Добровольческой армией",
            "Борьба против большевиков",
            "Эмиграция и литературная деятельность"
        ]
    }
];